<a href="https://colab.research.google.com/github/lucysigadah/moringa-data-science/blob/main/MORINGA_WK1_Getting_Started_with_Databases.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# STEP 1: CONNECT TO THE DATABASE

In [4]:
# We will first load an sql extension into our environment
# This extension will allow us to work with sql on Colaboratory

%load_ext sql

# We will then connect to our in memory sqlite database
# NB: This database will cease to exist as soon as the database connection is closed.
# We will learn more about how databases are created later in prep.

%sql sqlite://

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

# STEP 2: CREATING A TABLE

In [5]:
# Example 1
# We will now define and create a table Classmates in our database (if it doesn't exist).
# This table will have fields: PersonID, LastName, FirstName, Phone and Residence as shown below.
# We will then fetch all records from the table.

%%sql
SET sql.display.style = 'single_border';
CREATE TABLE if not exists Classmates(
  PersonId,
  LastName,
  FirstName,
  Phone,
  Residence
);

SELECT * FROM Classmates;

 * sqlite://
(sqlite3.OperationalError) near "SET": syntax error
[SQL: SET sql.display.style = 'single_border';]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [6]:
# Example 2
# In this example, we will create a table named Customers
# with the columns Id, Name, Age, Address, Salary.
# This kind of a table structure can be used by Sacco Management system.
# Then later fetch all records in the table.

%%sql
SET sql.display.style = 'single_border';
CREATE TABLE if not exists Customers(
  Id,
  Name,
  Age,
  Address,
  Salary
);

SELECT * FROM Customers;

 * sqlite://
(sqlite3.OperationalError) near "SET": syntax error
[SQL: SET sql.display.style = 'single_border';]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [7]:
# Example 3
# In this example, we will create a Students table for a student management system.
# This will contain the following fields,
# AdmissionsNo, FirstName, MiddleName, LastName, DateOfBirth and DateOfAdmission.
# Then fetch all records from Students table.

%%sql
SET sql.display.style = 'single_border';
CREATE TABLE if not exixts Students(
  AdmissionsNo,
  FirstName,
  MiddleName,
  LastName,
  DateOfbirth,
  DateOfAdmission
);

SELECT * FROM Students;

 * sqlite://
(sqlite3.OperationalError) near "SET": syntax error
[SQL: SET sql.display.style = 'single_border';]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

# CHALLENGES

In [8]:
# Challenge 1
# Let us create a table name PC with the following fields;
# Code, model, speed, RAM, HD, CD and Price.
# We also specify the appropriate data types to our table, then display it.
#

%%sql
SET sql.display.style = 'single_border';
CREATE TABLE if not exists PC(
  Code varchar(255),
  Model varchar(255),
  Speed int,
  RAM int,
  HD int,
  CD varchar(255),
  Price int
);

SELECT * FROM PC;

 * sqlite://
(sqlite3.OperationalError) near "SET": syntax error
[SQL: SET sql.display.style = 'single_border';]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [9]:
# Challenge 2
# Let us create a table named Printer with
# the following code, model, speed, type and Price.

%%sql
SET sql.display.style = 'single_border';
CREATE TABLE if not exists Printer(
  Code,
  Model,
  Speed,
  Type,
  price
);

 * sqlite://
(sqlite3.OperationalError) near "SET": syntax error
[SQL: SET sql.display.style = 'single_border';]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [10]:
# Challenge 3
# We can now write another table called Movies with the columns
# id, title, director, year and length_minutes

%%sql
SET sql.display.style = 'single_border';
CREATE TABLE if not exists Movies(
    Id,
    Title,
    Director,
    Year,
    Length_minutes
);

 * sqlite://
(sqlite3.OperationalError) near "SET": syntax error
[SQL: SET sql.display.style = 'single_border';]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

# STEP 3: SPECIFYING COLUMN DATA TYPES

In [11]:
# While defining our table, we should specify different data types.
# These datatypes will ensure that the particular column stores only
# records of that type i.e. The NationalID column in the defined Citizens table
# below will only take integer values. These are values between  -2,147,483,648 to 2,147,483,647.
# If one would require to store much smaller or bigger values than the range above then
# they can use a different datatype i.e. tinyint or bigint.
# The datatype varchar will hold letters and numbers upto the specified limit
# in the brackets.

%%sql
SET sql.display.style = 'single_border';
CREATE TABLE if not exists Citizens(
  NationalID int,
  FirstName varchar(255),
  MiddleName varchar(255),
  LastName varchar(255),
  PostalAddress varchar(2550),
  Residence varchar(255)
);

SELECT * FROM Citizens;

 * sqlite://
(sqlite3.OperationalError) near "SET": syntax error
[SQL: SET sql.display.style = 'single_border';]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [12]:
# Specifying column data types will ensure that
# the data that is stored within that table of the correct type.
# The data type date would ensure that the data stored is in the format YYYY-MM-DD.
# The data type boolean supports the storage of two values: TRUE or FALSE.
# No other data of a different nature would be accepted to the table
# than the one it was specified to have.

%%sql
SET sql.display.style = 'single_border';
CREATE TABLE if not exists Artists(
  Artist_ID int,
  ArtistName varchar(60),
  Artist_DOB date,
  Posters_In_Stock boolean
);

SELCT * FROM Artists;

 * sqlite://
(sqlite3.OperationalError) near "SET": syntax error
[SQL: SET sql.display.style = 'single_border';]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [13]:
# The data type text accepts upto 2,147,483,647 characters
# The data type float accepts floating point numbers i.e 183.3 as shown
#

%%sql
SET sql.display.style = 'single_border';
CREATE TABLE if not exists Players(
  id int,
  name text,
  age integer,
  height float
  );

  SELECT * FROM Players;

 * sqlite://
(sqlite3.OperationalError) near "SET": syntax error
[SQL: SET sql.display.style = 'single_border';]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

# CHALLENGES

In [ ]:
# Challenge 1
# Let's create a table customer with CustID with datatype Integer, LastName
# with datatype character(25), FirstName with datatype Character(20)
#

%%sql
SET sql.display.style = 'single_border';
CREATE TABLE IF NOT EXISTS customer (
    CustID INT,
    LastName VARCHAR(25),
    FirstName VARCHAR(20)
);

In [15]:
# Challenge 2
# Create a table called sales that stores sales ID, customer ID, name, and address information.
# using also the appropriate data types
#

%%sql
SET sql.display.style = 'single_border';
CREATE TABLE if not exists sales(
  salesID int,
  customerID varchar(255),
  name varchar(255),
  address varchar(255)
);

 * sqlite://
(sqlite3.OperationalError) near "SET": syntax error
[SQL: SET sql.display.style = 'single_border';]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [16]:
# Challenge 3
# Create a table called employees that stores employee number, employee name,
# department, and salary information using appropriate data types
#

%%sql
SET sql.display.style = 'single_border';
CREATE TABLE if not exists employees(
  employeeNumber int,
  employeeName varchar(255),
  department text,
  salary int,
);

 * sqlite://
(sqlite3.OperationalError) near "SET": syntax error
[SQL: SET sql.display.style = 'single_border';]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

# STEP 4: SPECIFYING COLUMN DEFAULT VALUES

In [17]:
# To specify column default values, let's define a table named artists
# which contains three columns artist_id, artist_name and place_of_birth.
# - artist_id will be of the type int
# - artist_name of the type varchar(60)
# - place_of_birth varchar(60) with default 'Unknown'.
# NB: Changing the case of our data type definition will not have any effect.
#

%%sql
SET sql.display.style = 'single_border';
CREATE TABLE if not exists Artists(
  ArtistID int,
  ArtistName varchar(60),
  PlaceOfBirth varchar(60) DEFAULT 'Unknown'
);

 * sqlite://
(sqlite3.OperationalError) near "SET": syntax error
[SQL: SET sql.display.style = 'single_border';]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [18]:
# To specify default values for the fields in a new table TeamMembers,
# We do the following as shown below.
#

%%sql
SET sql.display.style = 'single_border';
CREATE TABLE if not exists TeamMembers(
  id INTEGER  PRIMARY KEY,
  name TEXT,
  age INTEGER DEFAULT 'Unknown',
  height REAL
);

 * sqlite://
(sqlite3.OperationalError) near "SET": syntax error
[SQL: SET sql.display.style = 'single_border';]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

# CHALLENGES

In [19]:
# Challenge 1
# Let's create a new table called latest_players with similar fields to
# the already created Players table but specify the default value to unknown
#

%%sql
SET sql.display.style = 'single_border';
CREATE TABLE if not exists latest_players(
  id int,
  name text,
  age int DEFAULT 'Unknown',
  height float
);

 * sqlite://
(sqlite3.OperationalError) near "SET": syntax error
[SQL: SET sql.display.style = 'single_border';]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [20]:
# Challenge 2
# Let's create a new table called restaurants with the fields
# - name: string
# - description: text
# - address: string, default value is unknown
# - user_id: integer
# - last_orders_at: date
# We can perform data type external research if need be
#

%%sql
SET sql.display.style = 'single_border';
CREATE TABLE if not exists restaurants(
  name string,
  description text,
  address string DEFAULT 'Unknown',
  user_id int,
  last_order_at date
);

 * sqlite://
(sqlite3.OperationalError) near "SET": syntax error
[SQL: SET sql.display.style = 'single_border';]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

# STEP 5: ALTERING SQL TABLES

In [21]:
# Example 1: Adding a Column
# To add a column Gender to the Classmates table, we do the following,
# then preview the table to see the changes
#

%%sql
SET sql.display.style = 'single_border';
ALTER TABLE Classmates ADD COLUMN Gender;

SELECT * FROM Classmates;

 * sqlite://
(sqlite3.OperationalError) near "SET": syntax error
[SQL: SET sql.display.style = 'single_border';]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [22]:
# Example 2: Deleting a Column
# To delete a column Phone in a table above we do the following,
# Then fetch records from the table to confirm the changes
#

%%sql
SET sql.display.style = 'single_border';
ALTER TABLE Classmates DROP COLUMN Residence;

 * sqlite://
(sqlite3.OperationalError) near "SET": syntax error
[SQL: SET sql.display.style = 'single_border';]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [23]:
# Example 3
# We can change the name of the Classmates table to Schoolmates by doing the following,
# Then fetching the records from the table to confirm the changes
#

%%sql
SET sql.display.style = 'single_border';
ALTER TABLE Classmates RENAME TO Schoolmates;

SELECT * FROM Schoolmates;

 * sqlite://
(sqlite3.OperationalError) near "SET": syntax error
[SQL: SET sql.display.style = 'single_border';]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

# CHALLENGES

In [24]:
# Challenge 1
# We can add a column DOB with the data type DATE to the TeamMembers table by;
# Hint: The data type comes after the column name
#

%%sql
SET sql.display.style = 'single_border';
ALTER TABLE TeamMembers ADD COLUMN DOB date;

SELECT * FROM TeamMembers;

 * sqlite://
(sqlite3.OperationalError) near "SET": syntax error
[SQL: SET sql.display.style = 'single_border';]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [25]:
# Challenge 2
# Let's now add a column STUDIO with the data type TEXT to the Artists table
#

%%sql
SET sql.display.style = 'single_border';
ALTER TABLE Artists ADD COLUMN Studio text;

SELCT * FROM Artists;

 * sqlite://
(sqlite3.OperationalError) near "SET": syntax error
[SQL: SET sql.display.style = 'single_border';]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [26]:
# Challenge 3
# We then rename the table Artists to MusicArtists
#

%%sql
SET sql.display.style = 'single_border';
ALTER TABLE Artists RENAME TO MusicArtists;

SELECT * FROM MusicArtists;

 * sqlite://
(sqlite3.OperationalError) near "SET": syntax error
[SQL: SET sql.display.style = 'single_border';]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

# STEP 6: DROPPING SQL TABLES

## TRUNCATING A TABLE

In [27]:
# We may have two options while thinking about dropping (deleting) database tables.
# These are truncating or dropping.
# We can use the TRUNCATE TABLE statement to delete the data inside
# our table as shown below. Do note that this command retains the table itself.
# We will get to confirm the effect of using this command later when we get
# to insert data to the table.

%%sql
SET sql.display.style = 'single_border';
TRUNCATE TABLE Classmates;

 * sqlite://
(sqlite3.OperationalError) near "SET": syntax error
[SQL: SET sql.display.style = 'single_border';]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

## DROPPING A TABLE

In [28]:
# We can drop our table by using the DROP TABLE statement as shown below
#

%%sql
SET sql.display.style = 'single_border';
DROP TABLE Classmates;

 * sqlite://
(sqlite3.OperationalError) near "SET": syntax error
[SQL: SET sql.display.style = 'single_border';]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

# CHALLENGES

In [29]:
# Challenge 1
# Lets drop the Players table from our database
#

%%sql
SET sql.display.style = 'single_border';
DROP TABLE Players;

 * sqlite://
(sqlite3.OperationalError) near "SET": syntax error
[SQL: SET sql.display.style = 'single_border';]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [30]:
# Challenge 2
# Lets drop the Customers table from our database
#

%%sql
SET sql.display.style = 'single_border';
DROP TABLE Customers

 * sqlite://
(sqlite3.OperationalError) near "SET": syntax error
[SQL: SET sql.display.style = 'single_border';]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [31]:
# Challenge 3
# And finally truncate and drop our Artists table from our database
#

%%sql
SET sql.display.style = 'single_border';
TRUNCATE TABLE Artists;
DROP TABLE Artists;

 * sqlite://
(sqlite3.OperationalError) near "SET": syntax error
[SQL: SET sql.display.style = 'single_border';]
(Background on this error at: https://sqlalche.me/e/20/e3q8)